app/controllers/conta_controller.rb

  def saque
    @conta=Contum.find(params[:conta])
    if @conta.saldo.to_f-params[:saque].to_f>=0
      @conta.update_attribute(:saldo,@conta.saldo.to_f-params[:saque].to_f)
      Transacao.create(:codigo=>DateTime.now.to_i, :data=>Date.today, :nro_conta=>params[:conta], :tipo=>'saque', :valor=>params[:saque])
---
UPDATE `conta` SET `saldo` = 0.0, `limite` = 103.0, `updated_at` = '2013-12-12 13:40:49' WHERE `conta`.`numero` = 1
INSERT INTO `transacaos` (`codigo`, `created_at`, `data`, `nro_conta`, `nro_conta_transf`, `tipo`, `updated_at`, `valor`) VALUES (1386867243, '2013-12-12 16:54:03', '2013-12-12', 20, NULL, 'saque', '2013-12-12 16:54:03', 20.0)

  def deposito
    @conta=Contum.find(params[:conta])
    @conta.update_attributes(:saldo=>params[:saque].to_f+@conta.saldo.to_f)
    Transacao.create(:codigo=>DateTime.now.to_i, :data=>Date.today,:nro_conta=>params[:conta], :tipo=>'deposito', :valor=>params[:saque])
---
UPDATE `conta` SET `saldo` = 200.0, `updated_at` = '2013-12-12 16:17:47' WHERE `conta`.`numero` = 1
INSERT INTO `transacaos` (`codigo`, `created_at`, `data`, `nro_conta`, `nro_conta_transf`, `tipo`, `updated_at`, `valor`) VALUES (1386868667, '2013-12-12 17:17:47', '2013-12-12', 20, NULL, 'deposito', '2013-12-12 17:17:47', 20.0)

  def transferencia
    @conta=Contum.find(params[:origem])
    @conta2=Contum.find(params[:destino])
    if (@conta.saldo.to_f+@conta.limite.to_f)-params[:valor].to_f>=0
      aux=@conta.saldo.to_f-params[:valor].to_f
      if aux <=0
        @conta.limite=@conta.limite-aux
        @conta.saldo=0
      else
        @conta.saldo=aux
      end
        @conta.update_attributes(:saldo=>@conta.saldo,:limite=>@conta.limite)
        @conta2.update_attribute(:saldo,(@conta2.saldo+params[:valor].to_f))
      Transacao.create(:codigo=>DateTime.now.to_i, :data=>Date.today,:nro_conta=>params[:origem], :nro_conta_transf=>params[:destino],:tipo=>'transf', :valor=>params[:saque])
---
UPDATE `conta` SET `saldo` = 300.0, `updated_at` = '2013-12-12 17:28:10' WHERE `conta`.`numero` = 2
INSERT INTO `transacaos` (`codigo`, `created_at`, `data`, `nro_conta`, `nro_conta_transf`, `tipo`, `updated_at`, `valor`) VALUES (1386869290, '2013-12-12 17:28:10', '2013-12-12', 100, 2, 'transf', '2013-12-12 17:28:10', NULL)

  def extrato
    @extrato=Transacao.where("nro_conta = ?  and data > ?",params[:conta],params[:data].to_date-30)
---
SELECT `transacaos`.* FROM `transacaos` WHERE (nro_conta = '1' and data > '2013-11-30')

  def saldo
    @conta=Contum.find_by_numero(params[:conta])
---
SELECT `conta`.* FROM `conta` WHERE `conta`.`numero` = 1 LIMIT 1