app/controllers/contacriar_controller.rb

  def transferencia
    @conta=Contum.find(params[:origem])
    @conta2=Contum.find(params[:destino])
    if (@conta.saldo.to_f+@conta.limite.to_f)-params[:valor].to_f>=0
      aux=@conta.saldo.to_f-params[:valor].to_f
      if aux <=0
        @conta.limite=@conta.limite-aux
        @conta.saldo=0
      else
        @conta.saldo=aux
      end
        @conta.update_attributes(:saldo=>@conta.saldo,:limite=>@conta.limite)
        @conta2.update_attribute(:saldo,(@conta2.saldo+params[:valor].to_f))
        Transacao.create(:codigo=>DateTime.now.to_i, :data=>Date.today,:nro_conta=>params[:origem], :nro_conta_transf=>params[:destino],:tipo=>'transf', :valor=>params[:saque])
---
UPDATE `conta` SET `saldo` = 100.0, `updated_at` = '2013-12-13 19:33:11' WHERE `conta`.`numero` = 111
INSERT INTO `transacaos` (`codigo`, `created_at`, `data`, `nro_conta`, `nro_conta_transf`, `tipo`, `updated_at`, `valor`) VALUES (1386963191, '2013-12-13 19:33:11', '2013-12-13', 111, 111, 'transf', '2013-12-13 19:33:11', NULL)

  def extrato
           @extrato=Transacao.where("nro_conta = ?  and data > ?",params[:conta],params[:data].to_date-30)
---
SELECT `transacaos`.* FROM `transacaos` WHERE (nro_conta = '111' and data > '2013-11-30')

  def saldo
        @conta=Contum.find_by_numero(params[:conta])
---
SELECT `conta`.* FROM `conta` WHERE `conta`.`numero` = 111 LIMIT 1