app/controllers/funcionarios_controller.rb

SELECT `funcionarios`.* FROM `funcionarios`
---
  def index
    @funcionarios = Funcionario.all